# 10.1 GroupBy Mechanics

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                   'key2': ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

df

      data1     data2 key1 key2
0 -0.412673  1.428705    a  one
1  0.395233  0.762548    a  two
2 -1.274348  0.221008    b  one
3 -2.107059 -0.731853    b  two
4  0.058914  0.568430    a  one

In [3]:
grouped = df['data1'].groupby(df['key1'])

grouped

In [4]:
grouped.mean()

key1
a    0.013825
b   -1.690704
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

means

key1  key2
a     one    -0.176880
      two     0.395233
b     one    -1.274348
      two    -2.107059
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a    -0.176880  0.395233
b    -1.274348 -2.107059

In [0]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 
                   'Ohio'])

In [0]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [9]:
df['data1'].groupby([states, years]).mean()

California  2005    0.395233
            2006   -1.274348
Ohio        2005   -1.259866
            2006    0.058914
Name: data1, dtype: float64

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.013825  0.919894
b    -1.690704 -0.255423

In [11]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.176880  0.998567
     two   0.395233  0.762548
b    one  -1.274348  0.221008
     two  -2.107059 -0.731853

In [12]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

## Iterating Over Groups

In [13]:
for name, group in df.groupby('key1'):
  print(name)
  print(group)

a
      data1     data2 key1 key2
0 -0.412673  1.428705    a  one
1  0.395233  0.762548    a  two
4  0.058914  0.568430    a  one
b
      data1     data2 key1 key2
2 -1.274348  0.221008    b  one
3 -2.107059 -0.731853    b  two

In [14]:
for name, group in df.groupby('key2'):
  print(name)
  print(group)

one
      data1     data2 key1 key2
0 -0.412673  1.428705    a  one
2 -1.274348  0.221008    b  one
4  0.058914  0.568430    a  one
two
      data1     data2 key1 key2
1  0.395233  0.762548    a  two
3 -2.107059 -0.731853    b  two

In [15]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
  print((k1, k2))
  print(group)

('a', 'one')
      data1     data2 key1 key2
0 -0.412673  1.428705    a  one
4  0.058914  0.568430    a  one
('a', 'two')
      data1     data2 key1 key2
1  0.395233  0.762548    a  two
('b', 'one')
      data1     data2 key1 key2
2 -1.274348  0.221008    b  one
('b', 'two')
      data1     data2 key1 key2
3 -2.107059 -0.731853    b  two

In [16]:
pieces = dict(list(df.groupby('key1')))

pieces

{'a':       data1     data2 key1 key2
 0 -0.412673  1.428705    a  one
 1  0.395233  0.762548    a  two
 4  0.058914  0.568430    a  one, 'b':       data1     data2 key1 key2
 2 -1.274348  0.221008    b  one
 3 -2.107059 -0.731853    b  two}

In [17]:
pieces['b']

      data1     data2 key1 key2
2 -1.274348  0.221008    b  one
3 -2.107059 -0.731853    b  two

In [18]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [0]:
grouped = df.groupby(df.dtypes, axis = 1)

In [20]:
for dtype, group in grouped:
  print(dtype)
  print(group)

float64
      data1     data2
0 -0.412673  1.428705
1  0.395233  0.762548
2 -1.274348  0.221008
3 -2.107059 -0.731853
4  0.058914  0.568430
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

## Selecting a Column or Subset of Columns

In [0]:
# df.groupby('key1')['data1']
# df.groupby('key1')[['data2']]

# are syntactic sugar for:
  
# df['data1'].groupby(df['key1'])
# df[['data2']].groupby(df['key1'])

In [22]:
## In the preceding dataset, to compute means for just the data2
## column and get the result as a DataFrame:

df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.998567
     two   0.762548
b    one   0.221008
     two  -0.731853

In [23]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

s_grouped

In [24]:
s_grouped.mean()

key1  key2
a     one     0.998567
      two     0.762548
b     one     0.221008
      two    -0.731853
Name: data2, dtype: float64

## Grouping with Dicts and Series

In [0]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns = ['a', 'b', 'c', 'd', 'e'],
                      index = ['Joe', 'Steve', 'Wes', 'Jim', 
                               'Travis'])

In [0]:
people.iloc[2:3, [1, 2]] = np.nan   # Add a few NA values

In [27]:
people

               a         b         c         d         e
Joe     0.023180 -0.655958  1.274346 -0.358588 -0.225750
Steve   1.363546  0.649340 -1.833535 -0.164546  1.119019
Wes    -2.143942       NaN       NaN  0.168014  1.482342
Jim    -1.157791  0.746541 -1.172512  2.423550  0.151165
Travis -0.793349  0.056699  0.658373 -0.210359 -0.445809

In [0]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}

In [0]:
by_column = people.groupby(mapping, axis = 1)

In [30]:
by_column.sum()

            blue       red
Joe     0.915758 -0.858529
Steve  -1.998081  3.131904
Wes     0.168014 -0.661600
Jim     1.251039 -0.260085
Travis  0.448014 -1.182459

In [31]:
map_series = pd.Series(mapping)

map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [32]:
people.groupby(map_series, axis = 1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

## Grouping with Functions

In [33]:
## Group by the length of the names

people.groupby(len).sum()

          a         b         c         d         e
3 -3.278553  0.090583  0.101834  2.232976  1.407757
5  1.363546  0.649340 -1.833535 -0.164546  1.119019
6 -0.793349  0.056699  0.658373 -0.210359 -0.445809

In [0]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [35]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -2.143942 -0.655958  1.274346 -0.358588 -0.225750
  two -1.157791  0.746541 -1.172512  2.423550  0.151165
5 one  1.363546  0.649340 -1.833535 -0.164546  1.119019
6 two -0.793349  0.056699  0.658373 -0.210359 -0.445809

## Grouping by Index Levels

In [36]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names = ['cty', 'tenor'])

columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [37]:
hier_df = pd.DataFrame(np.random.randn(4, 5),
                       columns = columns)

hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.240514  0.547405  0.455351 -1.238070 -0.782708
1      2.768265 -0.960326 -0.155334 -1.120856  1.210564
2     -0.053295  0.297369  1.259057 -1.834425 -0.246770
3     -0.554768 -0.599851  0.596131 -0.594610 -0.108199

In [38]:
hier_df.groupby(level = 'cty', axis = 1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

# 10.2 Data Aggregation

## Optimized groupby methods

In [0]:
# https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/

data = pd.read_csv("https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2015/06/phone_data.csv")

In [40]:
data.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [0]:
import dateutil

# Convert date from string to date times
data['date'] = data['date'].apply(dateutil.parser.parse, 
                                  dayfirst = True)

In [42]:
data.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [43]:
# How many rows are there in the dataset?
data['item'].count()

830

In [44]:
# What was the longest phone call / data entry?
data['duration'].max()

10528.0

In [45]:
# How many seconds of phone calls are recorded in total?
data['duration'][data['item'] == 'call'].sum()

92321.0

In [46]:
# How many entries are there for each month?
data['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [47]:
# Number of non - null unique network entries
data['network'].nunique()

9

In [48]:
list(data['network'].unique())

['data',
 'Vodafone',
 'Meteor',
 'Tesco',
 'Three',
 'voicemail',
 'landline',
 'special',
 'world']

In [49]:
data.groupby(['month']).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [50]:
len(data.groupby(['month']).groups['2014-11'])

230

In [51]:
# Get the first entry for each month

data.groupby('month').first()

         index                date  duration  item   network network_type
month
2014-11      0 2014-10-15 06:58:00    34.429  data      data         data
2014-12    228 2014-11-13 06:58:00    34.429  data      data         data
2015-01    381 2014-12-13 06:58:00    34.429  data      data         data
2015-02    577 2015-01-13 06:58:00    34.429  data      data         data
2015-03    729 2015-02-12 20:15:00    69.000  call  landline     landline

In [52]:
# Get the sum of the durations per month

data.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [53]:
# Get the number of dates / entries in each month

data.groupby('month')['date'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [54]:
# What is the sum of durations, for calls only, to each network

data[data['item'] == 'call'].groupby('network')['duration'].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [55]:
# How many calls, sms, and data entries are in each month?

data.groupby(['month', 'item'])['date'].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

In [56]:
# How many calls, texts, and data are sent per month, 
# split by network_type?

data.groupby(['month', 'network_type'])['date'].count()

month    network_type
2014-11  data             29
         landline          5
         mobile          189
         special           1
         voicemail         6
2014-12  data             30
         landline          7
         mobile          108
         voicemail         8
         world             4
2015-01  data             31
         landline         11
         mobile          160
         voicemail         3
2015-02  data             31
         landline          8
         mobile           90
         special           2
         voicemail         6
2015-03  data             29
         landline         11
         mobile           54
         voicemail         4
         world             3
Name: date, dtype: int64

In [57]:
data.groupby('month')['duration'].sum() # produces Pandas Series

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [58]:
data.groupby('month')[['duration']].sum() # produces DataFrame Series

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [59]:
# GroupBy output will have an index or multi - index on rows
# corresponding to your chosen grouping variables. To avoid setting
# this index, pass "as_index = False" to the groupby operation

data.groupby('month', as_index = False).agg({"duration": "sum"})

     month   duration
0  2014-11  26639.441
1  2014-12  14641.870
2  2015-01  18223.299
3  2015-02  15522.299
4  2015-03  22750.441

In [60]:
aggregations = {
    'duration': {
        'total_duration': 'sum',
        'avg_duration': 'mean',
        'num_calls': 'count'
    },
    'date': {
        'max_date': 'max',
        'min_date': 'min',
        'num_days': lambda x: max(x) - min(x)
    },
    'network': ["count", "max"]
}

data[data['item'] == 'call'].groupby('month').agg(aggregations)

/usr/local/lib/python3.6/dist-packages/pandas/core/groupby.py:4291: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

              duration                                       date  \
        total_duration avg_duration num_calls            max_date
month
2014-11        25547.0   238.757009       107 2014-11-12 19:01:00
2014-12        13561.0   171.658228        79 2014-12-14 19:54:00
2015-01        17070.0   193.977273        88 2015-01-14 20:47:00
2015-02        14416.0   215.164179        67 2015-02-09 17:54:00
2015-03        21727.0   462.276596        47 2015-03-04 12:29:00

                                             network
                   min_date         num_days   count        max
month
2014-11 2014-10-15 06:58:00 28 days 12:03:00     107  voicemail
2014-12 2014-11-14 17:24:00 30 days 02:30:00      79  voicemail
2015-01 2014-12-15 20:03:00 30 days 00:44:00      88  voicemail
2015-02 2015-01-15 10:36:00 25 days 07:18:00      67  voicemail
2015-03 2015-02-12 20:15:00 19 days 16:14:00      47  voicemail

![alt text](https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2016/03/pandas_aggregation-732x293.png)

In [61]:
# Group the data frame by month and item and extract a number of
# stats from each group

data.groupby(['month', 'item']).agg({'duration': sum, # find the sum of the durations for each group
                                     'network_type': "count", # find the no. of network type entries
                                     'date': 'first'}) # get the first date per group

               duration  network_type                date
month   item
2014-11 call  25547.000           107 2014-10-15 06:58:00
        data    998.441            29 2014-10-15 06:58:00
        sms      94.000            94 2014-10-16 22:18:00
2014-12 call  13561.000            79 2014-11-14 17:24:00
        data   1032.870            30 2014-11-13 06:58:00
        sms      48.000            48 2014-11-14 17:28:00
2015-01 call  17070.000            88 2014-12-15 20:03:00
        data   1067.299            31 2014-12-13 06:58:00
        sms      86.000            86 2014-12-15 19:56:00
2015-02 call  14416.000            67 2015-01-15 10:36:00
        data   1067.299            31 2015-01-13 06:58:00
        sms      39.000            39 2015-01-15 12:23:00
2015-03 call  21727.000            47 2015-02-12 20:15:00
        data    998.441            29 2015-02-13 06:58:00
        sms      25.000            25 2015-02-19 18:46:00

In [62]:
# Group the data frame by month and item and extract a number of
# stats from each group

data.groupby(['month', 'item']).agg({'duration': [min, max, sum],
                                     'network_type': "count",
                                     'date': [min, 'first', 'nunique']})

             duration                       network_type                date  \
                  min        max        sum        count                 min
month   item
2014-11 call    1.000   1940.000  25547.000          107 2014-10-15 06:58:00
        data   34.429     34.429    998.441           29 2014-10-15 06:58:00
        sms     1.000      1.000     94.000           94 2014-10-16 22:18:00
2014-12 call    2.000   2120.000  13561.000           79 2014-11-14 17:24:00
        data   34.429     34.429   1032.870           30 2014-11-13 06:58:00
        sms     1.000      1.000     48.000           48 2014-11-14 17:28:00
2015-01 call    2.000   1859.000  17070.000           88 2014-12-15 20:03:00
        data   34.429     34.429   1067.299           31 2014-12-13 06:58:00
        sms     1.000      1.000     86.000           86 2014-12-15 19:56:00
2015-02 call    1.000   1863.000  14416.000           67 2015-01-15 10:36:00
        data   34.429     34.429   1067.299           31 2015-01-13 06:58:00
        sms     1.000      1.000     39.000           39 2015-01-15 12:23:00
2015-03 call    2.000  10528.000  21727.000           47 2015-02-12 20:15:00
        data   34.429     34.429    998.441           29 2015-02-13 06:58:00
        sms     1.000      1.000     25.000           25 2015-02-19 18:46:00


                           first nunique
month   item
2014-11 call 2014-10-15 06:58:00     104
        data 2014-10-15 06:58:00      29
        sms  2014-10-16 22:18:00      79
2014-12 call 2014-11-14 17:24:00      76
        data 2014-11-13 06:58:00      30
        sms  2014-11-14 17:28:00      41
2015-01 call 2014-12-15 20:03:00      84
        data 2014-12-13 06:58:00      31
        sms  2014-12-15 19:56:00      58
2015-02 call 2015-01-15 10:36:00      67
        data 2015-01-13 06:58:00      31
        sms  2015-01-15 12:23:00      27
2015-03 call 2015-02-12 20:15:00      47
        data 2015-02-13 06:58:00      29
        sms  2015-02-19 18:46:00      17

In [63]:
## To remove multi-index set from the column axis when multiple
## statistics are calculated on columns, drop the top level 
## (using .droplevel)

grouped = data.groupby('month').agg({'duration': [min, max, 'mean']})

grouped.columns = grouped.columns.droplevel(level = 0)

grouped.rename(columns = {"min": "min_duration", 
                          "max": "max_duration",
                          "mean": "mean_duration"})

grouped.head()

## But this approach loses the original column names, leaving only
## the function names as column headers.

         min      max        mean
month
2014-11  1.0   1940.0  115.823657
2014-12  1.0   2120.0   93.260318
2015-01  1.0   1859.0   88.894141
2015-02  1.0   1863.0  113.301453
2015-03  1.0  10528.0  225.251891

In [64]:
## A neater approach is using the ravel() method on the grouped
## columns. ravel() turns a Pandas multi-index into a simpler array,
## which we can combine into sensible column names:

grouped = data.groupby('month').agg({'duration': [min, max, 'mean']})

# Using ravel() and a string join, we can create better names for the columns

grouped.columns = ["_".join(x) for x in grouped.columns.ravel()]

grouped

         duration_min  duration_max  duration_mean
month
2014-11           1.0        1940.0     115.823657
2014-12           1.0        2120.0      93.260318
2015-01           1.0        1859.0      88.894141
2015-02           1.0        1863.0     113.301453
2015-03           1.0       10528.0     225.251891

In [65]:
df

      data1     data2 key1 key2
0 -0.412673  1.428705    a  one
1  0.395233  0.762548    a  two
2 -1.274348  0.221008    b  one
3 -2.107059 -0.731853    b  two
4  0.058914  0.568430    a  one

In [66]:
grouped = df.groupby('key1')

grouped

In [67]:
grouped['data1'].quantile(0.9)

key1
a    0.327969
b   -1.357619
Name: data1, dtype: float64

In [0]:
def peak_to_peak(arr):
  return arr.max() - arr.min()

In [69]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.807906  0.860275
b     0.832710  0.952862

In [70]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.013825  0.405836 -0.412673 -0.176880  0.058914  0.227074
b      2.0 -1.690704  0.588815 -2.107059 -1.898881 -1.690704 -1.482526

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.395233   3.0  0.919894  0.451206  0.568430  0.665489  0.762548
b    -1.274348   2.0 -0.255423  0.673775 -0.731853 -0.493638 -0.255423


           75%       max
key1
a     1.095626  1.428705
b    -0.017207  0.221008

## Column - Wise and Multiple Function Application

In [71]:
from google.colab import files

uploaded = files.upload()

Saving tips.csv to tips.csv

In [0]:
tips = pd.read_csv("tips.csv")

In [0]:
# Add tip percentage of total bill

tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [74]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [0]:
grouped = tips.groupby(['day', 'smoker'])

In [0]:
grouped_pct = grouped['tip_pct']

In [77]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [78]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [79]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [0]:
functions = ['count', 'mean', 'max']

In [81]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [82]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [0]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [84]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [85]:
grouped.agg({'tip': np.max, 'size': 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [86]:
grouped.agg({'tip_pct': ['min', 'max', 'mean', 'std'],
             'size': 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

## Returning Aggregated Data Without Row Indexes

In [87]:
tips.groupby(['day', 'smoker'], as_index = False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [88]:
tips.groupby(['day', 'smoker'], as_index = True).mean()

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.151650
     Yes      16.813333  2.714000  2.066667  0.174783
Sat  No       19.661778  3.102889  2.555556  0.158048
     Yes      21.276667  2.875476  2.476190  0.147906
Sun  No       20.506667  3.167895  2.929825  0.160113
     Yes      24.120000  3.516842  2.578947  0.187250
Thur No       17.113111  2.673778  2.488889  0.160298
     Yes      19.190588  3.030000  2.352941  0.163863

# 10.3 Apply: General split-apply-combine

In [0]:
def top(df, n = 5, column = 'tip_pct'):
  return df.sort_values(by = column)[-n:]

In [90]:
## Selecting the top 6 tip_pct values by group

top(tips, n = 6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [91]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [92]:
tips.groupby(['smoker', 'day']).apply(top, n = 1, column = 'total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [93]:
result = tips.groupby('smoker')['tip_pct'].describe()

result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [94]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [95]:
f = lambda x: x.describe()

grouped.apply(f)

                   total_bill        tip       size    tip_pct
day  smoker
Fri  No     count    4.000000   4.000000   4.000000   4.000000
            mean    18.420000   2.812500   2.250000   0.151650
            std      5.059282   0.898494   0.500000   0.028123
            min     12.460000   1.500000   2.000000   0.120385
            25%     15.100000   2.625000   2.000000   0.137239
            50%     19.235000   3.125000   2.000000   0.149241
            75%     22.555000   3.312500   2.250000   0.163652
            max     22.750000   3.500000   3.000000   0.187735
     Yes    count   15.000000  15.000000  15.000000  15.000000
            mean    16.813333   2.714000   2.066667   0.174783
            std      9.086388   1.077668   0.593617   0.051293
            min      5.750000   1.000000   1.000000   0.103555
            25%     11.690000   1.960000   2.000000   0.133739
            50%     13.420000   2.500000   2.000000   0.173913
            75%     18.665000   3.240000   2.000000   0.209240
            max     40.170000   4.730000   4.000000   0.263480
Sat  No     count   45.000000  45.000000  45.000000  45.000000
            mean    19.661778   3.102889   2.555556   0.158048
            std      8.939181   1.642088   0.784960   0.039767
            min      7.250000   1.000000   1.000000   0.056797
            25%     14.730000   2.010000   2.000000   0.136240
            50%     17.820000   2.750000   2.000000   0.150152
            75%     20.650000   3.390000   3.000000   0.183915
            max     48.330000   9.000000   4.000000   0.291990
     Yes    count   42.000000  42.000000  42.000000  42.000000
            mean    21.276667   2.875476   2.476190   0.147906
            std     10.069138   1.630580   0.862161   0.061375
            min      3.070000   1.000000   1.000000   0.035638
            25%     13.405000   2.000000   2.000000   0.091797
            50%     20.390000   2.690000   2.000000   0.153624
...                       ...        ...        ...        ...
Sun  No     std      8.130189   1.224785   1.032674   0.042347
            min      8.770000   1.010000   2.000000   0.059447
            25%     14.780000   2.000000   2.000000   0.139780
            50%     18.430000   3.020000   3.000000   0.161665
            75%     25.000000   3.920000   4.000000   0.185185
            max     48.170000   6.000000   6.000000   0.252672
     Yes    count   19.000000  19.000000  19.000000  19.000000
            mean    24.120000   3.516842   2.578947   0.187250
            std     10.442511   1.261151   0.901591   0.154134
            min      7.250000   1.500000   2.000000   0.065660
            25%     17.165000   3.000000   2.000000   0.097723
            50%     23.100000   3.500000   2.000000   0.138122
            75%     32.375000   4.000000   3.000000   0.215325
            max     45.350000   6.500000   5.000000   0.710345
Thur No     count   45.000000  45.000000  45.000000  45.000000
            mean    17.113111   2.673778   2.488889   0.160298
            std      7.721728   1.282964   1.179796   0.038774
            min      7.510000   1.250000   1.000000   0.072961
            25%     11.690000   1.800000   2.000000   0.137741
            50%     15.950000   2.180000   2.000000   0.153492
            75%     20.270000   3.000000   2.000000   0.184843
            max     41.190000   6.700000   6.000000   0.266312
     Yes    count   17.000000  17.000000  17.000000  17.000000
            mean    19.190588   3.030000   2.352941   0.163863
            std      8.355149   1.113491   0.701888   0.039389
            min     10.340000   2.000000   2.000000   0.090014
            25%     13.510000   2.000000   2.000000   0.148038
            50%     16.470000   2.560000   2.000000   0.153846
            75%     19.810000   4.000000   2.000000   0.194837
            max     43.110000   5.000000   4.000000   0.241255

[64 rows x 4 columns]

## Suppressing the Group Keys

In [96]:
tips.groupby('smoker', group_keys = False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

## Quantile and Bucket Analysis

In [0]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

In [0]:
quartiles = pd.cut(frame.data1, 4)

In [99]:
quartiles[:10]

0    (-1.706, -0.111]
1     (-0.111, 1.485]
2    (-1.706, -0.111]
3    (-1.706, -0.111]
4     (-0.111, 1.485]
5    (-1.706, -0.111]
6    (-1.706, -0.111]
7    (-1.706, -0.111]
8    (-1.706, -0.111]
9    (-1.706, -0.111]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.308, -1.706] < (-1.706, -0.111] < (-0.111, 1.485] <
                                    (1.485, 3.081]]

In [0]:
def get_stats(group):
  return {'min': group.min(), 'max': group.max(),
          'count': group.count(), 'mean': group.mean()}

In [0]:
grouped = frame.data2.groupby(quartiles)

In [102]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.308, -1.706]   32.0  1.357356  0.249289 -1.208471
(-1.706, -0.111]  436.0  3.115400 -0.011516 -2.800793
(-0.111, 1.485]   467.0  3.600166 -0.012812 -3.003360
(1.485, 3.081]     65.0  1.786840  0.149755 -2.347641

In [0]:
# These were equal - length buckets; to compute equal - size buckets
# based on sample quantiles, use qcut. Pass labels = False to just
# get quantile numbers

# Return quantile numbers

grouping = pd.qcut(frame.data1, 10, labels = False)

In [0]:
grouped = frame.data2.groupby(grouping)

In [105]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  3.115400 -0.003088 -2.800793
1      100.0  2.354254  0.068705 -2.069115
2      100.0  2.296102  0.105907 -2.585467
3      100.0  2.561277 -0.124170 -2.019384
4      100.0  2.153230 -0.087888 -3.003360
5      100.0  2.719679 -0.056025 -2.242753
6      100.0  2.437779 -0.022336 -2.718109
7      100.0  1.738308 -0.002029 -2.079963
8      100.0  3.600166  0.009280 -2.444282
9      100.0  1.786840  0.178715 -2.347641

## Example: Filling Missing Values with Group - Specific Values

In [0]:
s = pd.Series(np.random.randn(6))

In [107]:
s[::2] = np.nan

s

0         NaN
1    0.028932
2         NaN
3   -0.636678
4         NaN
5    0.800298
dtype: float64

In [108]:
s.fillna(s.mean())

0    0.064184
1    0.028932
2    0.064184
3   -0.636678
4    0.064184
5    0.800298
dtype: float64

In [0]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

In [0]:
group_key = ['East'] * 4 + ['West'] * 4

In [111]:
data = pd.Series(np.random.randn(8), index = states)

data

Ohio          2.124099
New York     -0.009433
Vermont       0.432183
Florida       0.559603
Oregon        1.158138
Nevada       -0.585635
California    1.075367
Idaho         0.541705
dtype: float64

In [0]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [113]:
data

Ohio          2.124099
New York     -0.009433
Vermont            NaN
Florida       0.559603
Oregon        1.158138
Nevada             NaN
California    1.075367
Idaho              NaN
dtype: float64

In [114]:
data.groupby(group_key).mean()

East    0.891423
West    1.116753
dtype: float64

In [0]:
fill_mean = lambda g: g.fillna(g.mean())

In [116]:
data.groupby(group_key).apply(fill_mean)

Ohio          2.124099
New York     -0.009433
Vermont       0.891423
Florida       0.559603
Oregon        1.158138
Nevada        1.116753
California    1.075367
Idaho         1.116753
dtype: float64

In [0]:
fill_values = {'East': 0.5, 'West': -1}

In [0]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [119]:
data.groupby(group_key).apply(fill_func)

Ohio          2.124099
New York     -0.009433
Vermont       0.500000
Florida       0.559603
Oregon        1.158138
Nevada       -1.000000
California    1.075367
Idaho        -1.000000
dtype: float64

## Example: Random Sampling and Permutation

In [0]:
# Hearts, Spades, Clubs, Diamonds

suits = ['H', 'S', 'C', 'D']

card_val = (list(range(1, 11)) + [10] * 3) * 4

base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']

cards = []

for suit in suits:
  cards.extend(str(num) + suit for num in base_names)
  
deck = pd.Series(card_val, index = cards)

In [121]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [0]:
# Drawing a hand of 5 cards from the deck could be written as:

def draw(deck, n = 5):
  return deck.sample(n)

In [123]:
draw(deck)

7H     7
KC    10
6S     6
2S     2
9C     9
dtype: int64

In [0]:
# Suppose we wanted 2 random cards from each suit. Because the suit
# is the last character of each card name, we can group based on this
# and use apply:

get_suit = lambda card: card[-1] # last letter is suit

In [125]:
deck.groupby(get_suit).apply(draw, n = 2)

C  3C     3
   4C     4
D  4D     4
   7D     7
H  7H     7
   8H     8
S  JS    10
   8S     8
dtype: int64

In [126]:
# Alternatively, we could write:

deck.groupby(get_suit, group_keys = False).apply(draw, n = 2)

9C     9
2C     2
5D     5
JD    10
9H     9
QH    10
7S     7
QS    10
dtype: int64

## Example: Group Weighted Average and Correlation

In [127]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

df

  category      data   weights
0        a  0.354396  0.420453
1        a -0.144848  0.320950
2        a -0.075920  0.152437
3        a  0.008565  0.456587
4        b -0.500049  0.029131
5        b -1.244772  0.638392
6        b  0.942586  0.407486
7        b -0.123267  0.095405

In [0]:
grouped = df.groupby('category')

In [0]:
get_wavg = lambda g: np.average(g['data'], weights = g['weights'])

In [130]:
grouped.apply(get_wavg)

category
a    0.070241
b   -0.373277
dtype: float64

In [131]:
uploaded = files.upload()

Saving stock_px_2.csv to stock_px_2.csv

In [0]:
close_px = pd.read_csv("stock_px_2.csv", parse_dates = True,
                       index_col = 0)

In [133]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [134]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [0]:
## We can compute a DataFrame consisting of the yearly correlations
## of daily returns (computed from percent changes) with SPX.
## One way to do this involves creating a function which computes
## the pairwise correlation of each column with the 'SPX' column

spx_corr = lambda x: x.corrwith(x['SPX'])

In [0]:
## Next, we compute percent change on close_px using pct_change():

rets = close_px.pct_change().dropna()

In [0]:
## Lastly, we group these percent changes by year, which can be
## extracted from each row label with a one - line function that
## returns the year attribute of each datetime label

get_year = lambda x: x.year

In [0]:
by_year = rets.groupby(get_year)

In [139]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [140]:
## Annual correlation between Apple and Microsoft

by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

## Example: Group - Wise Linear Regression

In [141]:
import statsmodels.api as sm

/usr/local/lib/python3.6/dist-packages/statsmodels/compat/pandas.py:56: FutureWarning: The pandas.core.datetools module is deprecated and will be removed in a future version. Please use the pandas.tseries module instead.
  from pandas.core import datetools

In [0]:
## regress function from the statsmodels library executes an
## ordinary least squares (OLS) regression on each chunk of data

def regress(data, yvar, xvars):
  Y = data[yvar]
  X = data[xvars]
  X['intercept'] = 1.
  result = sm.OLS(Y, X).fit()
  return result.params

In [143]:
## Yearly linear regression of AAPL on SPX returns:

by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

# 10.4 Pivot Tables and Cross - Tabulation

In [144]:
## What if we wanted to compute a table of group means
## (the default pivot_table aggregation type) arranged by day and
## smoker on the rows:

tips.pivot_table(index = ['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [145]:
## Suppose we want to aggregate only tip_pct and size, and additionally
## group by time. We'll put smoker in the table columns and day in
## the rows

tips.pivot_table(['tip_pct', 'size'], index = ['time', 'day'],
                 columns = 'smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [146]:
## We could augment this table to include partial totals by passing
## margins = True, which will add 'All' row and column labels, with
## corresponding values being the group statistics for all the data
## within a single tier

tips.pivot_table(['tip_pct', 'size'], index = ['time', 'day'],
                 columns = 'smoker', margins = True)

## Here, the 'All' values are means without taking into account
## smoker vs. non - smoker (the All columns) or any of the 2 levels
## of grouping on the rows (the All row)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [147]:
## To use a different aggregation function, use aggfunc. E.g. 'count'
## or len will give us a cross-tabulation (count or frequency)
## of group sizes

tips.pivot_table('tip_pct', index = ['time', 'smoker'],
                 columns = 'day', aggfunc = len, margins = True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [148]:
## If some combinations are empty (or NA), pass a fill_value:

tips.pivot_table('tip_pct', index = ['time', 'size', 'smoker'],
                 columns = 'day', aggfunc = 'mean', fill_value = 0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [149]:
tips.pivot_table('tip_pct', index = ['time', 'size', 'smoker'],
                 columns = 'day', aggfunc = 'mean', dropna = True,
                 fill_value = 0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

## Cross - Tabulations: Crosstab

In [150]:
data = pd.DataFrame({'Sample': 1 + np.arange(10),
                     'Nationality': ['USA', 'Japan', 'USA',
                                     'Japan', 'Japan', 'Japan',
                                     'USA', 'USA', 'Japan', 'USA'],
                     'Handedness': ['Right-handed', 'Left-handed',
                                    'Right-handed', 'Right-handed',
                                    'Left-handed', 'Right-handed',
                                    'Right-handed', 'Left-handed',
                                    'Right-handed', 'Right-handed']})

data

     Handedness Nationality  Sample
0  Right-handed         USA       1
1   Left-handed       Japan       2
2  Right-handed         USA       3
3  Right-handed       Japan       4
4   Left-handed       Japan       5
5  Right-handed       Japan       6
6  Right-handed         USA       7
7   Left-handed         USA       8
8  Right-handed       Japan       9
9  Right-handed         USA      10

In [151]:
pd.crosstab(data.Nationality, data.Handedness, margins = True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [152]:
data.pivot_table(index = 'Nationality', columns = 'Handedness',
                 margins = True, aggfunc = len)

                 Sample
Handedness  Left-handed Right-handed All
Nationality
Japan                 2            3   5
USA                   1            4   5
All                   3            7  10

In [153]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins = True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244